import article1 from "../assets/img/sofa.webp";
import article2 from "../assets/img/windows.webp";
import article3 from "../assets/img/mop.jpg";

const articlesData = [
  {
    title:
      "Як уникнути плям на дивані: корисні поради для догляду за м'якими меблями",
    image: article1,
    description:
      'Для кожного не секрет, що м\'які меблі можуть стати "ловушкою" для пилу та бруду, що накопичується на їх поверхні...',
    date: "23/03/2024",
    link: "/blog/pets",
    fullText:
      "Для кожного не секрет, що м'які меблі можуть стати \"ловушкою\" для пилу та бруду, що накопичується на їх поверхні. І саме цей надлишок пилу може стати причиною появи неприємних плям та розводів на тканині, навіть від звичайної води. У цій статті ми поділимося корисними порадами, як уникнути цього неприємного явища та зберегти ваш диван в ідеальному стані.\n Чому вода може залишати плями на дивані:\n Вода може розмивати бруд, але при цьому залишати неприємні плями та розводи на тканині. Це стається через те, що пил та інші забруднення, які накопичилися на поверхні дивану, можуть просто розпливатися разом із водою та залишати пляму.\n Як уникнути плям на дивані:\nЩоб уникнути цього, рекомендується підтримувати регулярну гігієну м'яких меблів. Пилососити диван потрібно хоча б раз на тиждень за допомогою насадки, призначеної саме для м'яких меблів. Це дозволить ефективно видаляти пил та забруднення, що накопичилися у волокнах тканини, і запобігти появі плям після контакту з водою.\nПоради щодо видалення плям:\nЯкщо на ваш диван пролилась рідина, не витирайте її, а промочуйте м'якою ганчіркою, щоб вбрати рідину без збільшення плями. Не наносіть агресивних мийних засобів, оскільки це може законсервувати пляму і ускладнити її виведення в подальшому. У деяких випадках можна використовувати мильний розчин з фейрі, але будьте готові до того, що це мило може вимагати спеціального обладнання для повного видалення з тканини.\nЗберігайте ваш диван в ідеальному стані та уникайте неприємних сюрпризів з неприємними плямами завдяки правильному догляду та регулярній гігієні м'яких меблів.",
  },
  {
    title: "Поради щодо миття вікон: уникнення розводів",
    image: article2,
    description:
      "Миття вікон - це важлива частина догляду за будинком чи офісом...",
    date: "28/02/2024",
    link: "/blog/mirrors-cleaning",
    fullText:
      "Миття вікон - це важлива частина догляду за будинком чи офісом. Проте, важливо пам'ятати, що правильне миття вікон може стати складною задачею. Давайте розглянемо, чому не слід мити вікна в мороз або жарку погоду, і як уникнути розводів та плям на склі.\n*Чому не мити вікна в мороз:*\nНизькі температури можуть заморожувати воду, що робить процес миття не таким ефектним. Мороз призведе до замерзання води на склі, що утворить розводи. І звісно, це не дуже приємно для самого виконавця. \n*Миття вікон у спеку:*\nСпекотна погода також може створити свої проблеми під час миття вікон. Занадто швидке висихання миючих засобів на склі, рамах може призводити до розводів та плям . Рекомендується мити вікна у спокійніші часи дня, коли сонце не найактивніше, або у вечірній час.\n*Правильна техніка миття вікон:*\nНезалежно від погодних умов, важливо використовувати правильну техніку миття вікон. Це включає використання мильного розчину та стяжки для видалення залишків мила та бруду. Не використовуйте мийні засоби які призначені для полірування скла на брудні,  запилені, вікна. Ви просто розтягнете бруд по склі, це в свою чергу призводить до розводів. \nМиття вікон - це важлива частина догляду за будинком чи офісом, але важливо робити це правильно, враховуючи погодні умови. Насолоджуйтесь своїм чистим і яскравим простором з бездоганним видом завдяки правильному миттю вікон.",
  },
  {
    title:
      "Миття підлоги без розводів: корисні поради для бездоганного результату",
    image: article3,
    description:
      "Миття підлоги - це важлива частина догляду за вашим приміщенням...",
    date: "02/02/2024",
    link: "/blog/toxic-cleaning-items",
    fullText:
      "Миття підлоги - це важлива частина догляду за вашим приміщенням, але часто може призводити до появи неприємних розводів на поверхні. У цій статті ми поділимося корисними порадами, як досягти бездоганного результату без розводів під час миття підлоги.\n*Грамотний вибір мийних засобів:*\nОдним з ключових моментів для досягнення безрозводного результату є грамотний вибір мийного засобу. Засоби, придбані у маcмаркетах, частіше за все містять компоненти, які можуть залишати після себе плівку на підлозі, що сприяє налипанню бруду. Рекомендується вибирати якісні мийні засоби, які не містять агресивних компонентів і не залишають за собою слідів. Ми користуємося мийними засобами німецького виробника KIEHL.\n*Користуйтеся знімними насадками для швабр:*\nЩе одним важливим аспектом є використання швабр з знімними мопами або насадками. Після кожного миття підлоги, рекомендується знімати моп або насадку з швабри і прати їх у пральній машині. Це допомагає позбавитися від залишків бруду та мийного засобу на мопі, що забезпечує наступне миття без розводів.\nМиття підлоги без розводів - це нескладний процес, який може бути досягнутий за допомогою правильного підходу та вибору засобів. Слід пам'ятати про важливість використання якісних мийних засобів та регулярне прання насадок для швабр для досягнення найкращого результату.",
  },
  // {
  //   title: "Правильне миття вікон",
  //   image: article4,
  //   description:
  //     "Брудні вікна - це неприємність для будь-якої оселі. Вони також можуть призвести до проблем з енергоефективністю.",
  //   date: "16/11/2023",
  //   link: "/blog/window-cleaning",
  //   fullText:
  //     "Брудні вікна - це неприємність для будь-якої оселі. Вони також можуть призвести до проблем з енергоефективністю. Один із способів підтримувати вікна в чистоті - скористатися послугами професіоналів з миття вікон. Але ви також можете впоратися з миттям вікон самостійно, якщо у вас є відповідні інструменти та засоби для чищення.\n*Як мити вікна без розводів*\nОднією з найпоширеніших скарг на вікна в будинку є те, що вони брудні та мають розводи. Якщо ви хочете переконатися, що ваші вікна чисті та прозорі, виконайте ці кроки, щоб дізнатися, як мити вікна зсередини.\nПо-перше, що спричиняє появу розводів на вікнах? Зазвичай це ваш миючий засіб. Все, що залишає плівку на вікні, може призвести до появи розводів. Швидкість випаровування миючого засобу також може призвести до появи розводів на вікнах. Якщо ви миєте вікна в спекотний день, рідина може випаровуватися дуже швидко. Це призводить до нерівномірного розподілу вологих і сухих ділянок, що спричиняє появу розводів.\nЩоб уникнути розводів під час миття вікон, дотримуйтесь цих професійних порад. А коли миєте вікна в приміщенні, не забудьте покласти кілька старих рушників, щоб зловити краплі води і запобігти пошкодженню стін або підвіконь.\n*Крок 1:* Використовуйте засоби на основі аміаку або спирту. Ці миючі засоби не залишають на склі плівки, яка спричиняє появу розводів. Розчин білого оцту і води (див. нижче) також є хорошим вибором, так само як і мило і вода.\n*Крок 2:* Якщо ваше вікно запилене або забруднене, спочатку протріть його чистою сухою ганчіркою з мікрофібри, щоб видалити надлишки. Це зменшить ймовірність залишення розводів.\n*Крок 3:* Вимийте вікно зверху вниз, використовуючи миючий засіб. Використовуйте засіб щедро, щоб він не випаровувався надто швидко і не залишав розводів.\n*Крок 4:* Обробіть складні плями невеликою кількістю медичного спирту на серветці з мікрофібри. Не використовуйте бритву для видалення стійких плям, оскільки вона може подряпати скло.\n*Крок 5:* Використовуйте скребок, щоб видалити всю рідину для чищення. Або ж використовуйте чисту безворсову тканину. Залишки води можна відполірувати газетою. Газета - чудовий засіб для чищення, оскільки вона безворсова і добре вбирає воду.\nПорада професіонала: Не всі газети однакові. У той час як більшість газет використовують чорнило на соєвій основі, яке не розтікається, деякі використовують чорнило на нафтовій основі. Таке чорнило може залишати мазки або плями. Щоб перевірити газету, потримайте сторінку з великим шрифтом (наприклад, заголовок) протягом хвилини. Якщо вона забруднить ваші пальці, не використовуйте її на вікнах.",
  // },
];

export default articlesData;
