import Breadcrumb from "react-bootstrap/Breadcrumb";
const Privacy = () => {
  return (
    <>
      <div className="container">
        <div className="breadcrumbs">
          <Breadcrumb>
            <Breadcrumb.Item href="#">Головна</Breadcrumb.Item>
            <Breadcrumb.Item active>Політика конфіденційності</Breadcrumb.Item>
          </Breadcrumb>
        </div>
        <h2 className="heading privacy">Політика конфіденційності</h2>
        <div className="privacy__text">
          <p className="privacy__desc">
            <p className="privacy-txt">
              Ця Політика конфіденційності персональних даних (далі - Політика
              конфіденційності) діє відносно всієї інформації, яку цей
              Інтернет-ресурс, може отримати про Користувача під час
              використання сайту, програм і продуктів сайту.
            </p>

            <div className="privacy-item">
              <p className="privacy-head">1. ВИЗНАЧЕННЯ ТЕРМІНІВ</p>
              <p className="privacy-txt">
                1.1 У цій Політиці конфіденційності використовуються такі терміни:
              </p>
              <p className="privacy-txt">
                1.1.1. «Адміністрація сайту Інтернет-ресурсу (далі - Адміністрація
                сайту)» - уповноважені співробітники на управління сайтом, що
                діють від імені цього інтернет-сайту, які організовують і здійснює
                обробку персональних даних, а також визначає цілі обробки
                персональних даних, склад персональних даних, що підлягають
                обробці , дії або операції, що здійснюються з персональними даними
              </p>
              <p className="privacy-txt">
                1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або
                сукупність дій (операцій), що здійснюються з використанням засобів
                автоматизації або без використання таких засобів з персональними
                даними, включаючи збір, запис, систематизацію, накопичення,
                зберігання, уточнення (оновлення, зміна), витяг, використання,
                передачу (поширення, надання, доступ), знеособлення, блокування,
                видалення, знищення персональних даних.
              </p>
              <p className="privacy-txt">
                1.1.4. «Конфіденційність персональних даних» - обов'язкове для
                дотримання Адміністратором або іншим отримав доступ до
                персональних даних особою вимога не допускати їх поширення без
                згоди суб'єкта персональних даних або наявності іншого законного
                підстави.
              </p>
              <p className="privacy-txt">
                1.1.5. «Користувач сайту» - особа, яка має доступ до Сайту, за
                допомогою мережі Інтернет і використовує Сайт інтернет-ресурсу.
              </p>
              <p className="privacy-txt">
                1.1.6. «Cookies» - невеликий фрагмент даних, відправлений
                веб-сервером і зберігається на комп'ютері користувача, який
                веб-клієнт або веб-браузер кожен раз пересилає веб-серверу в
                HTTP-запиті при спробі відкрити сторінку відповідного сайту.
              </p>
              <p className="privacy-txt">
                1.1.7. «IP-адреса» - унікальний мережеву адресу вузла в
                комп'ютерній мережі, побудованої за протоколом IP.
              </p>
              <p className="privacy-head"> 2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</p>
              <p className="privacy-txt">
                2.1. Використання Користувачем сайту Інтернет-ресурсу означає
                згоду з цією Політикою конфіденційності та умовами обробки
                персональних даних Користувача.
              </p>
              <p className="privacy-txt">
                2.2. У разі незгоди з умовами Політики конфіденційності Користувач
                повинен припинити використання цього сайту.
              </p>
              <p className="privacy-txt">
                2.3. Дана Політика конфіденційності застосовується лише до цього
                сайту. Інтернет-ресурс не контролює і не несе відповідальність за
                сайти третіх осіб, на які Користувач може перейти по посиланнях,
                доступним на сайті інтернет-ресурсу.
              </p>
              <p className="privacy-txt">
                2.4. Адміністрація сайту не перевіряє достовірність персональних
                даних, що надаються Користувачем сайту Інтернет-ресурсу.
              </p>
            </div>

            <div className="privacy-item">
              <p className="privacy-head">3. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</p>
              <p className="privacy-txt">
                3.1. Справжня Політика конфіденційності встановлює зобов'язання
                Адміністрації сайту інтернет-ресурсу щодо нерозголошення та
                забезпечення режиму захисту конфіденційності персональних даних,
                які Користувач повинен за вимогою надати Адміністрації сайту при
                реєстрації на сайті інтернет-ресурсу або при оформленні замовлення
                для придбання Послуги.
              </p>
              <p className="privacy-txt">
                3.2. Персональні дані, дозволені до обробки в рамках цієї Політики
                конфіденційності, надаються Користувачем шляхом заповнення
                реєстраційної форми на цьому сайті і включають в себе наступну
                інформацію:
              </p>
              <p className="privacy-txt">3.2.1. ПІБ Користувача;</p>
              <p className="privacy-txt">3.2.2. контактний телефон Користувача;</p>
              <p className="privacy-txt">3.2.3. адреса електронної пошти (e-mail).</p>
              <p className="privacy-txt">
                3.3. Інтернет-ресурс захищає Дані, які автоматично передаються в
                процесі перегляду рекламних блоків і при відвідуванні сторінок, на
                яких встановлено статистичний скрипт системи ( "піксель"):
              </p>
              <p className="privacy-txt">- IP адреса;</p>
              <p className="privacy-txt">- інформація з cookies;</p>
              <p className="privacy-txt">
                - інформація про браузер (чи іншої програми, яка здійснює доступ
                до показу реклами);
              </p>
              <p className="privacy-txt">- час доступу;</p>
              <p className="privacy-txt">- адреса сторінки, на якій розташований рекламний блок;</p>
              <p className="privacy-txt">- реферер (адреса попередньої сторінки).</p>
              <p className="privacy-txt">
                3.3.1. Відключення cookies може спричинити неможливість доступу до
                частин сайту Інтернет-ресурсу, що вимагають авторизації.
              </p>
              <p className="privacy-txt">
                3.3.2. Інтернет-ресурс здійснює збір статистики про IP-адреси
                своїх відвідувачів. Дана інформація використовується з метою
                виявлення і вирішення технічних проблем, для контролю законності
                проведених фінансових платежів.
              </p>
              <p className="privacy-txt">
                3.4. Будь-яка інша персональна інформація, не обумовлені вище
                (історія замовлень, які використовуються браузери і операційні
                системи і т.д.), підлягає надійному зберіганню і нерозповсюдження,
                за винятком випадків, передбачених в п.п. 5.2. і 5.3. цієї
                Політики конфіденційності.
              </p>
            </div>

            <div className="privacy-item">
              <p className="privacy-head">4. ЦІЛІ ЗБОРУ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ КОРИСТУВАЧА</p>
              <p className="privacy-txt">
                4.1. Персональні дані Користувача Адміністрація сайту
                інтернет-ресурсу може використовувати в цілях:
              </p>
              <p className="privacy-txt">
                {" "}
                4.1.1. Ідентифікації Користувача, зареєстрованого на цьому сайті,
                для оформлення замовлення і (або) укладення Договору
                купівлі-продажу товару / послуги дистанційним способом.
              </p>
              <p className="privacy-txt">
                4.1.2. Надання Користувачеві доступу до персоналізованих ресурсів
                Сайту інтернет-ресурсу.
              </p>
              <p className="privacy-txt">
                4.1.3. Встановлення з Користувачем зворотного зв'язку, включаючи
                напрямок повідомлень, запитів, що стосуються використання Сайту
                інтернет-ресурсу, надання послуг, обробка запитів і заявок від
                Користувача.
              </p>
              <p className="privacy-txt">
                4.1.4. Визначення місця знаходження Користувача для забезпечення
                безпеки, запобігання шахрайства.
              </p>
              <p className="privacy-txt">
                4.1.5. Підтвердження достовірності та повноти персональних даних,
                наданих Користувачем.
              </p>
              <p className="privacy-txt">
                4.1.6. Створення облікового запису для здійснення покупок /
                замовлень, якщо Користувач дав згоду на створення облікового
                запису.
              </p>
              <p className="privacy-txt">
                4.1.7. Повідомлення Користувача Сайту інтернет-ресурсу про стан
                Замовлення.
              </p>
              <p className="privacy-txt">4.1.8. Обробки і отримання платежів.</p>
              <p className="privacy-txt">
                4.1.9. Надання Користувачеві ефективної клієнтської і технічної
                підтримки при виникненні проблем пов'язаних з використанням Сайту
                інтернет-ресурсу.
              </p>
              <p className="privacy-txt">
                4.1.10. Надання Користувачеві з його згоди, оновлень продукції,
                спеціальних пропозицій, інформації про ціни, розсилки новин та
                інших відомостей від імені нашої компанії.
              </p>
              <p className="privacy-txt">
                4.1.11. Здійснення рекламної діяльності за згодою Користувача.
              </p>
            </div >

            <div className="privacy-item">
              <p className="privacy-head">5. СПОСОБИ І ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ</p>
              <p className="privacy-txt">
                5.1. Обробка персональних даних Користувача здійснюється без
                обмеження терміну, будь-яким законним способом, в тому числі в
                інформаційних системах персональних даних з використанням засобів
                автоматизації або без використання таких засобів.
              </p>
              <p className="privacy-txt">
                5.2. Користувач погоджується з тим, що Адміністрація сайту має
                право передавати персональні дані третім особам, зокрема,
                кур'єрським службам, організаціями поштового зв'язку, операторам
                електрозв'язку, виключно з метою виконання замовлення Користувача,
                оформленого на цьому Сайті, включаючи доставку.
              </p>
              <p className="privacy-txt">
                5.3. Персональні дані Користувача можуть бути передані
                уповноваженим органам державної влади тільки на підставах та в
                порядку, встановленим законодавством.
              </p>
              <p className="privacy-txt">
                5.4. При втраті або розголошення персональних даних Адміністрація
                сайту інформує Користувача про втрату або розголошення
                персональних даних.
              </p>
              <p className="privacy-txt">
                5.5. Адміністрація сайту вживає необхідних організаційних і
                технічних заходів для захисту персональної інформації Користувача
                від неправомірного або випадкового доступу, знищення,
                перекручення, блокування, копіювання, поширення, а також від інших
                неправомірних дій третіх осіб.
              </p>
              <p className="privacy-txt">
                {" "}
                5.6. Адміністрація сайту спільно з Користувачем вживає всіх
                необхідних заходів щодо запобігання збиткам або інших негативних
                наслідків, викликаних втратою або розголошенням персональних даних
                Користувача.
              </p>
            </div >

           <div className="privacy-item">
              <p className="privacy-head">6. ЗОБОВ'ЯЗАННЯ СТОРІН</p>
              <p className="privacy-txt"> 6.1. Користувач зобов'язаний:</p>
              <p className="privacy-txt">
                {" "}
                6.1.1. Надати інформацію про персональні дані, необхідну для
                користування цим Сайтом.
              </p>
              <p className="privacy-txt">
                {" "}
                6.1.2. Оновити, доповнити надану інформацію про персональні дані в
                разі зміни даної інформації.
              </p>
              <p className="privacy-txt"> 6.2. Адміністрація сайту зобов'язана:</p>
              <p className="privacy-txt">
                {" "}
                6.2.1. Використовувати отриману інформацію виключно для цілей,
                зазначених у п. 4 цієї Політики конфіденційності.
              </p>
              <p className="privacy-txt">
                6.2.2. Забезпечити зберігання конфіденційної інформації в
                таємниці, не розголошувати без попередньої письмової згоди
                Користувача, а також не здійснювати продаж, обмін, опублікування,
                або розголошення іншими можливими способами переданих персональних
                даних Користувача, за винятком п.п. 5.2. і 5.3. цієї Політики
                Конфіденційності.
              </p>
              <p className="privacy-txt">
                6.2.3. Вживати заходів обережності для захисту конфіденційності
                персональних даних Користувача згідно з порядком, який зазвичай
                використовується для захисту такого роду інформації в існуючому
                діловому обороті.
              </p>
              <p className="privacy-txt">
                {" "}
                6.2.4. Здійснити блокування персональних даних, що відносяться до
                відповідного Користувачеві, з моменту звернення або запиту
                Користувача або його законного представника або уповноваженого
                органу з захисту прав суб'єктів персональних даних на період
                перевірки, в разі виявлення недостовірних персональних даних або
                неправомірних дій.
              </p>
           </div >

            <div className="privacy-item">
              <p className="privacy-head"> 7. ВІДПОВІДАЛЬНІСТЬ СТОРІН</p>
              <p className="privacy-txt">
                7.1. Адміністрація сайту, яка не виконала свої зобов'язання, несе
                відповідальність за збитки, понесені Користувачем у зв'язку з
                неправомірним використанням персональних даних, відповідно до
                законодавства, за винятком випадків, передбачених п.п. 5.2., 5.3.
                і 7.2. цієї Політики Конфіденційності.
              </p>
              <p className="privacy-txt">
                7.2. У разі втрати або розголошення Конфіденційної інформації
                Адміністрація сайту не несе відповідальність, якщо дана
                конфіденційна інформація:
              </p>
              <p className="privacy-txt">
                7.2.1. Стала публічним надбанням до її втрати або розголошення.
              </p>
              <p className="privacy-txt">
                {" "}
                7.2.2. Була отримана від третьої сторони до моменту її отримання
                Адміністрацією сайту.
              </p>
              <p className="privacy-txt"> 7.2.3. Була розголошена за згодою Користувача.</p>

            </div> 
            <div className="privacy-item">
              <p className="privacy-head"> 8. ВИРІШЕННЯ СПОРІВ</p>
              <p className="privacy-txt">
                8.1. До звернення в суд з позовом у спорах, що виникають із
                відносин між Користувачем сайту Інтернет-ресурсу і Адміністрацією
                сайту, обов'язковим є пред'явлення претензії (письмового
                пропозиції про добровільне врегулювання спору).
              </p>
              <p className="privacy-txt">
                8.2 .Получатель претензії протягом 30 календарних днів з дня
                отримання претензії, письмово повідомляє заявника претензії про
                результати розгляду претензії.
              </p>
              <p className="privacy-txt">
                {" "}
                8.3. При не досягненні угоди суперечка буде переданий на розгляд
                до судового органу відповідно до чинного законодавства.
              </p>
              <p className="privacy-txt">
                {" "}
                8.4. До цій Політиці конфіденційності та відносин між Користувачем
                і Адміністрацією сайту застосовується чинне законодавство.
              </p>
            </div>

            <div className="privacy-item">
              <p className="privacy-head"> 9. ДОДАТКОВІ УМОВИ</p>
              <p className="privacy-txt">
                {" "}
                9.1. Адміністрація сайту має право вносити зміни в справжню
                Політику конфіденційності без згоди Користувача.
              </p>
              <p className="privacy-txt">
                {" "}
                9.2. Нова Політика конфіденційності вступає в силу з моменту її
                розміщення на Сайті інтернет-ресурсу, якщо інше не передбачено
                новою редакцією Політики конфіденційності.
              </p>
              <p className="privacy-txt">
                {" "}
                9.3. Діюча Політика конфіденційності розміщена на цій сторінці.
              </p>
            </div >
          </p>
        </div>
      </div>
    </>
  );
};

export default Privacy;
