import Accordion from "react-bootstrap/Accordion";
import { motion, useInView } from "framer-motion";
import { useRef } from "react";

const QuestionItem = ({ eventKey, question, answer }) => (
  <div className='questions__item'>
    <Accordion.Item eventKey={eventKey}>
      <Accordion.Header>{question}</Accordion.Header>
      <Accordion.Body>{answer}</Accordion.Body>
    </Accordion.Item>
  </div>
);

const Questions = () => {
  const ref = useRef(null);
  const isInView = useInView(ref, { once: true });
  const questions = [
    {
      question: "Чи виїжджаєте ви за межі міста?",
      answer:
        "Так, виїжджаємо при мінімальній сумі замовлення 14000 гривень (в залежності від відстані, вартість може збільшуватися). Це може бути комплексне прибирання з миттям вікон та хімчисткою. Залежно від відстані об’єкта дорога може сплачуватись замовником.",
    },
    {
      question: "Чи боретесь ви з пліснявою?",
      answer:
        "Із пліснявою ми не боремось. Існують спеціальні служби, які цим займаються.",
    },
    {
      question: "Чи робите окремо прибирання ванної/кухні?",
      answer:
        "Так, робимо. Але в такому випадку ціна розраховується не за площею (м²). Вартість буде залежати від того, чи потрібно мити всередині в шафах, у духовці та холодильнику. Ціна за таке прибирання обговорюється окремо.",
    },
    {
      question: "Чи обов'язково знаходитись вдома під час прибирання?",
      answer:
        "Вдома знаходитись необов’язково. На об’єкт приходить 5-6 працівників, робота ведеться одночасно і під час прибирання у кожній кімнаті працює 1 людина. Краще розпланувати день заздалегідь і вирішити питання перебування у будинку, адже клінінг - справа активна, під час виконання замовлення відбувається великий рух по будинку. Ми не хочемо заважати вашій роботі, тож подумайте чи вам буде зручно працювати чи робити інші необхідні справи під час прибирання",
    },
    {
      question: "Чи працюєте ви на свята?",
      answer: "Так, ми працюємо завжди.",
    },
    {
      question: "Чи включено у вартість генерального прибирання миття вікон?",
      answer: "Ні, не включено. Так як миттям вікон займаються інші клінери.",
    },
    {
      question:
        "Чи включено у вартість генерального прибирання миття шаф в середині, миття побутової техніки, складання речей в гардеробі?",
      answer:
        "Ні, не включено. Це додаткові послуги. Ви можете додати будь який вид додаткових послуг, так як вони відносяться на кожному прибиранні. Чим більше додаткових послуг відповідно більше клінерів, часу іде на прибирання, щоб прибирання було надано якісно.",
    },
    {
      question: "Чи миєте рами від фасадної фарби з вулиці?",
      answer:
        "Ні, у вартість миття вікон не входить відмивання рам від такого роду будівельних сумішей саме з вулиці, особливо у багатоповерхових будинках (але якщо для вас це принципове питання, ми з радістю все обговоримо, та зробимо все для того щоб ви були задоволені наданою послугою)",
    },
  ];

  return (
    <div className='container'>
      <div className='questions' ref={ref}>
        <h2 className='heading'>Популярні питання</h2>
        <motion.div
          className='questions__wrapper'
          initial={{
            opacity: 0,
            y: 100,
          }}
          animate={{
            opacity: isInView ? 1 : 0,
            y: isInView ? 0 : 100,
          }}
          transition={{
            duration: 0.5,
            delay: 0.8,
          }}
        >
          <Accordion>
            {questions.map((item, index) => (
              <QuestionItem
                key={index}
                eventKey={index.toString()}
                question={item.question}
                answer={item.answer}
              />
            ))}
          </Accordion>
        </motion.div>
      </div>
    </div>
  );
};

export default Questions;
